"""Напишите и запустите программу. которая выводит строку  "Hello world!"""
print("Hello world!")
