"""
Напишите программу, которая на входе получает 2 числа,
производит с ними арифметическую операцию(на ваше усмотрение),
и выводит “Результат = {результат}”.
"""
a = float(input("Введите первое число:"))
b = float(input("Ведите второе число:"))
print(f"Сумма {a} и  {b} равна: {str(a + b)}")
