"""
Напишите программу, которая на входе получает имя пользователя,
сохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
"""
user_name = input("Введите имя:")
print(f"Hello {user_name}!")
